АлогистикТест2/src/Catalogs/РазмерСечения/РазмерСечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РазмерСечения</name>
  <owners>Catalog.КатегорииНоменклатуры</owners>
  <attributes>
    <name>ШиринаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТолщинаММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиаметрММ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСечения</name>
    <type>
      <types>EnumRef.ВидыСечений</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/КатегорииНоменклатуры/КатегорииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КатегорииНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>БезКатегории</name>
      <description>&lt;Без категории></description>
    </items>
    <items>
      <name>Карандаши</name>
      <description>Карандаши</description>
    </items>
    <items>
      <name>Кора</name>
      <description>Кора</description>
    </items>
    <items>
      <name>Окорка</name>
      <description>Окорка</description>
    </items>
    <items>
      <name>Опилки</name>
      <description>Опилки</description>
    </items>
    <items>
      <name>ОтходыПилмат</name>
      <description>Отходы производства пиломатериалов</description>
    </items>
    <items>
      <name>Пиловочник</name>
      <description>Пиловочник</description>
    </items>
    <items>
      <name>Пиломатериал</name>
      <description>Пиломатериал</description>
    </items>
    <items>
      <name>ПиломатериалСП</name>
      <description>Пиломатериал (СП)</description>
    </items>
    <items>
      <name>Шпон</name>
      <description>Шпон</description>
    </items>
    <items>
      <name>ШпонКусковой</name>
      <description>Шпон кусковой</description>
    </items>
    <items>
      <name>Щепа</name>
      <description>Щепа</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидАлкогольнойПродукции</name>
    <type>
      <types>CatalogRef.ВидыАлкогольнойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмпортнаяАлкогольнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПоКлассификатору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристики</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатурыПоУмолчанию</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

АлогистикТест2/src/Catalogs/РазмерСечения/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	СтруктураРеквизитов = Новый Структура("ШиринаММ, ТолщинаММ, ДиаметрММ", ШиринаММ, ТолщинаММ, ДиаметрММ);	
	ЕстьДубдь = ЭтоДублер(Владелец, СтруктураРеквизитов);
	
	Если ЕстьДубдь Тогда 		
		Сообщить("Есть дубль данного сечения!");
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда		
		Отказ = ЕстьДубдь;     		
	КонецЕсли;
	
	СформироватьНаименование();
	
КонецПроцедуры

Процедура СформироватьНаименование()
	
	Если Владелец = Справочники.КатегорииНоменклатуры.Карандаши Тогда
		Наименование       = "d " + Формат(ДиаметрММ, "ЧГ=");
		НаименованиеПолное = "d " + Формат(ДиаметрММ, "ЧГ=") + " (мм.)";
	ИначеЕсли Владелец = Справочники.КатегорииНоменклатуры.Пиломатериал ИЛИ Владелец = Справочники.КатегорииНоменклатуры.ПиломатериалСП Тогда 
		Наименование       = Формат(ТолщинаММ, "ЧГ=") + " Х " + Формат(ШиринаММ, "ЧГ=");
		НаименованиеПолное = Формат(ТолщинаММ, "ЧГ=") + " Х " + Формат(ШиринаММ, "ЧГ=") + " (мм.)";
	ИначеЕсли Владелец = Справочники.КатегорииНоменклатуры.Пиловочник ИЛИ Владелец = Справочники.КатегорииНоменклатуры.Окорка Тогда 
		Наименование       = "d " + Формат(ДиаметрММ/10, "ЧГ=");
		НаименованиеПолное = "d " + Формат(ДиаметрММ/10, "ЧГ=") + " (см.)";	
	Иначе
		Наименование       = Формат(ШиринаММ, "ЧГ=") + " Х " + Формат(ТолщинаММ, "ЧГ=");
		НаименованиеПолное = Формат(ШиринаММ, "ЧГ=") + " Х " + Формат(ТолщинаММ, "ЧГ=") + " (мм.)";			
	КонецЕсли; 
	
КонецПроцедуры

Функция ЭтоДублер(ВладелецСправочника, КонтролируемыеРеквизиты)
	
	Дубль = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РазмерСечения.Ссылка
	|ИЗ
	|	Справочник.РазмерСечения КАК РазмерСечения
	|ГДЕ
	|	РазмерСечения.Владелец = &Владелец
	|	И НЕ РазмерСечения.ПометкаУдаления
	|	И РазмерСечения.ШиринаММ = &ШиринаММ
	|	И РазмерСечения.ТолщинаММ = &ТолщинаММ
	|	И РазмерСечения.ДиаметрММ = &ДиаметрММ
	|	И НЕ РазмерСечения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	Запрос.УстановитьПараметр("Владелец", 	ВладелецСправочника);
	Запрос.УстановитьПараметр("ШиринаММ", 	КонтролируемыеРеквизиты.ШиринаММ);
	Запрос.УстановитьПараметр("ТолщинаММ", 	КонтролируемыеРеквизиты.ТолщинаММ);
	Запрос.УстановитьПараметр("ДиаметрММ", 	КонтролируемыеРеквизиты.ДиаметрММ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Дубль = Истина;
		
	КонецЕсли; 
	
	Возврат Дубль;
	
КонецФункции // ЭтоДублер()
